//----------------------------------------------------------------------------------------
//  Wireless Access Point Advertiser
//----------------------------------------------------------------------------------------
//  Written by Pacess HO.
//  Copyright Pacess Studio, 2020.  All rights reserved.
//----------------------------------------------------------------------------------------

#include <ESP8266WiFi.h>

//----------------------------------------------------------------------------------------
//  Global variables
const char _maxAP = 13;
const char *_ssid[_maxAP] = {
  "人生中有歡喜",
  "難免亦常有淚",
  "總算是歡笑多於唏噓",
  
  "人生不免崎嶇",
  "難以絕無掛慮",
  "拋棄區分求共對",

  "放開彼此心中矛盾",
  "理想一起去追",
  "同舟人誓相隨",
  "無畏更無懼",

  "同處海角天邊",
  "攜手踏平崎嶇",
  "不朽香江名句"
};
unsigned int _id = 0;

//----------------------------------------------------------------------------------------
void setup()  {}

//----------------------------------------------------------------------------------------
void loop()  {
  WiFi.softAP(_ssid[_id], "");
  delay(1000*10);
  if (_id++ >= _maxAP)  {_id = 0;}
}
